use UUNIVER;

insert into STUDENT(IDGROUP, NAME, BDAY, INFO)
	values(22, 'Яскович М.Э.', '10.07.2002',
	'<студент>
		<паспорт серия="АВ" номер="2864982" дата="31.07.2014" />
		<телефон>+375298213235</телефон>
		<адрес>
			<страна>Беларусь</страна>
			<город>Брест</город>
			<улица>Колесника</улица>
			<дом>4</дом>
			<квартира>54</квартира>
		</адрес>
	</студент>');
select * from STUDENT where NAME = 'Яскович М.Э.';
update STUDENT set INFO = '<студент>
					           <паспорт серия="AB" номер="2864982" дата="31.07.2014" />
						       <телефон>375298213235</телефон>
							   <адрес>
								  <страна>Беларусь</страна>
								  <город>Брест</город>
								  <улица>Колесника</улица>
	         					  <дом>4</дом>
								  <квартира>54</квартира>
								</адрес>
							</студент>' where NAME='Яскович М.Э.'
select NAME[ФИО], INFO.value('(студент/паспорт/@серия)[1]', 'char(2)')[Серия паспорта],
	INFO.value('(студент/паспорт/@номер)[1]', 'varchar(20)')[Номер паспорта],
	INFO.query('/студент/адрес')[Адрес]
		from  STUDENT
			where NAME = 'Яскович М.Э.';       
